# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

#+latex: \newcommand{\mytitle}{Ponteiros e Passagem de Arranjos}
#+latex: \mytitleslide

* Exemplo #3 ~a28-diferencas.c~

#+BEGIN_SRC C :tangle a28-diferencas.c
#include <stdio.h>
#define TAM 3
int main() {

  int vetor[TAM] = {1,2,3};
  int *p;
  p = vetor; //operação válida. Atribui a p o endereço do primeiro elemento de v
  vetor = p; //operação inválida (pois vetor aponta para um endereço fixo)

  return 0;
}
#+END_SRC

#+latex: \pause

Compilando para ver *error*

#+begin_src shell :results output :exports both
gcc a28-diferencas.c 2> x; cat x
#+end_src

#+RESULTS:
: a28-diferencas.c: In function ‘main’:
: a28-diferencas.c:8:9: error: assignment to expression with array type
:     8 |   vetor = p; //operação inválida (pois vetor aponta para um endereço fixo)
:       |         ^

* Exemplo #4 ~a28-strings.c~

Strings são vetores de caracteres.

#+BEGIN_SRC C :tangle a28-strings.c :results output :exports both
#include <stdio.h>
int main() {
  char str[80] = "Alpha Centauri";
  char *p1;

  //atribui à p1 o endereço do primeiro elemento de str
  p1 = str;

  //imprimir o mesmo elementos com dois atalhos
  printf("[%c] = [%c]\n", str[0], *p1);

  // str[4] ou *(p1+4) acessam o 5o caractere (elemento) de str
  printf("[%c] = [%c]\n", str[4], *(p1+4));

  return 0;
}
#+END_SRC

#+RESULTS:
: [A] = [A]
: [a] = [a]

* Endereçamento com aritmética de ponteiros

Como funciona o endereçamento com vetores?
#+attr_latex: :options fontsize=\large
#+begin_src C :results output :exports both
int vetor[4] = { 45, 34, 12, 78 };
int i = 2, *p;
p = vetor;
printf("[%d]\n", *(p + i));
#+end_src

#+RESULTS:
: [12]

#+latex: \pause

E para matrizes (armazenamento por linha), como funciona?
#+attr_latex: :options fontsize=\large
#+begin_src C :results output :exports both
#define COLUNAS 3
int matriz[][COLUNAS] = {2, 3, 5, 4, 8, 0}; // 2x3
int i = 1, j = 1, *p;
p = matriz;
printf("[%d]\n", *(p + i * COLUNAS + j));
#+end_src

#+RESULTS:
: [8]

Seleciona Linha: =i*COLUNAS= -- Seleciona Coluna: =j=

